/*******************************************************************************
 * 文件名  ：board.c
 * 描述    ：硬件初始化
 * 硬件平台：STM32F030，2.4G遥控模块
 * 库版本  STM32F0_Discovery_Library
 * 作者   谭金龙
*******************************************************************************/
#include "board.h"


/*******************************************************************************
*Function:系统初始化
*parm:none
*description:
*******************************************************************************/
void board_init(void)
{
    delay_init();
    LED_Init();    //LED灯初始化
    USART_Configuration(115200);//串口通信初始化
    USART2_Init(9600);
}
